app/Controllers/MainSongController.php

SELECT *
FROM `tbl_song`
SELECT *
FROM `tbl_playlist`
---
    public function display()
{
    $search = $this->request->getGet('search'); // Get the search query from the URL

    // Check if a search query is provided
    if ($search) {
        // Perform a database query to search for songs based on the $search value
        $data = [
            'songs' => $this->songs->searchSongs($search), // Replace with your search function
            'playlists' => $this->playlists->findAll(),
        ];

    } else {
        // No search query, display all songs
        $data = [
            'songs' => $this->songs->findAll(),
            'playlists' => $this->playlists->findAll(),
        ];

SELECT *
FROM `tbl_playlist`
WHERE `tbl_playlist`.`playlist_id` = '12'
SELECT *
FROM `tbl_song`
---
    public function addToPlaylist()
    {
        $song_id = $this->request->getPost('song_id');
        $playlist_id = $this->request->getPost('playlistId');

        $playlist = $this->playlists->find($playlist_id);

        // if ($playlist) {
        $data = [
            'playlist_id' => $playlist_id,
            'song_id' => $song_id,
            'songs' => $this->songs->findAll(),
            // 'playlists' => $this->playlists->findAll(),
        ];

SELECT *
FROM `tbl_playlist`
---
    public function playlist($playlistId)
    {
        // Fetch songs associated with the selected playlist using your model
        $songs = $this->songs->getSongsForPlaylist($playlistId); // Adjust this based on your data structure
        // Store the songs in the $data array
        $data = [
            'songs' => $songs,
            'playlists' => $this->playlists->findAll(),
            'playlistId' => $playlistId,
        ];