app/Models/TblSongModel.php

SELECT `tbl_song`.*
FROM `tbl_song`
JOIN `bridge` ON `bridge`.`song_id` = `tbl_song`.`song_id`
WHERE `bridge`.`playlist_id` = '12'
---
    public function getSongsForPlaylist($playlistId)
    {
        // Assuming you have a pivot table named 'playlist_songs'
        // and a column 'playlist_id' that links playlists to songs
        // and 'song_id' that links songs to playlists

        $builder = $this->db->table('tbl_song');
        $builder->select('tbl_song.*'); // Select the song fields you need
        $builder->join('bridge', 'bridge.song_id = tbl_song.song_id');
        $builder->where('bridge.playlist_id', $playlistId);

        return $builder->get()->getResultArray();

SELECT *
FROM `tbl_song`
WHERE `title` LIKE '%Lihim%' ESCAPE '!'
---
    public function searchSongs($searchTerm)
    {
        return $this->like('title', $searchTerm)->findAll();